BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
    return 0;
    //Connection failed.
  }


  // Serial.printf("\n Time taken: %dms.", (int)(millis() - start_time)); */
}

uint32_t getServerTimeUnix(void){ //Obsolete!!
  //Cnnects to server, sends a request and returns unix time in UTC from server.
  return 0;
}

int32_t generateMeasurementValue(unsigned char type, float value){
  int32_t measurement=0; 

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     measurement = (int16_t)(value*10);
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    measurement = (uint8_t)(value);
  }
  return(measurement);
}

String formatMeasurementValue(unsigned char type, float value){  //Converts measurements into valid format
  char measurement [10];  //4B string array for the value.
  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string.

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     itoa((signed short int)(value * 10), measurement, 10);   //Takes the first digit after comma.
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    itoa((unsigned char)(value), measurement, 10);    //Takes only integer part.
  }

  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string
  Serial.printf("\n\nMeasurement:");
  Serial.printf(measurement);
  return( String(measurement) );
}

void* stringToArray(std::string origin_string){
    //This function should return -1 if the size of "a" (destination array) is smaller than "s"
    //to avoid buffer overflow and possible fragmentation faults...
    int string_length = (origin_string.length()) + 1 ;

    char* s = (char*) malloc(string_length);
    strcpy(s, origin_string.c_str());

    return (s);
}

void goDeepSleep(uint64_t time){
  // time is in milliseconds.
  
  if( time > 3600000 ) time = 3600000;  //Maximum 1h (3600 sec).
  
  uint32_t t = time/1000;
 
  rtcmem.setElapsedTime(t + millis()/1000);   //in seconds
  /*  If forced wake up, elapsed time should 
  */
  // rtcmem.setElapsedTime(t + millis()/1000);   //in seconds

  Serial.printf("\nGoing deep sleep for %d seconds... ", (t));

  ESP.deepSleep(time*1000, WAKE_RF_DISABLED);  //deep sleeps for 5 seconds...
}

void setSensorPower(unsigned char state){
  if (state == ON)
  {
    digitalWrite(PWR_SENSORS_PIN_P, LOW);  //Turn sensors supply on.
    digitalWrite(PWR_SENSORS_PIN_N, HIGH);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned on.");
  }
  if (state == OFF)
  {
    digitalWrite(PWR_SENSORS_PIN_P, HIGH);  //Turn sensors supply off.
    digitalWrite(PWR_SENSORS_PIN_N, LOW);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned off.");
  }
}

void wifiTurnOff(void){
  WiFi.disconnect(true);  //Turns off wifi module, so in the wake up it won\\\"t turn on automatically until required.
  delay(1);
  WiFi.mode( WIFI_OFF );  //Wifi starts turned off after wake up, in order to save energy.
  delay(1);
  WiFi.forceSleepBegin(); 
  delay(1);
}

void wifiTurnOn(void){
  WiFi.forceSleepWake();    //Turns on radio.
  delay(1);   //Necessary delay to settle.
  WiFi.mode(WIFI_STA);  // Bring up the WiFi connection.
  WiFi.persistent(false); //Wifi credentials loaded directly from flash (as specified below) and not overwritten to it.
}

bool initglobals(void){
  /*  Read configuration file (JSON) and load data into Config_globals struct. 
  First load all the data from file into a string, and then parse it to a Json buffer,
  to then extract the values from each keyword.
  If file not found, load default values, defined in this function.
  */

  config_globals = readGlobals();
  
  return false;
}

bool log_event(uint16_t event_type){ 
  /*
    Log timestamp, battery status and event type into flash memory.
  */
  Logs l;
  l.battery_level = getBatteryLevel();    //Current battery level.
  l.timestamp = rtcmem.getCurrentTime();  //Current timestamp.
  l.event_type = event_type;

  File file = SPIFFS.open(LOGS_FILE_NAME, "a");   //Open file to append
  if (file){
    int bytesWritten = file.write((const char*)(&log), sizeof(Logs)); //Overwrites previous data.
    file.close();
    Serial.printf("\nEvent (type %d) logged.", l.event_type);
    return true;
  }
  return false;
}

uint16_t read_log(void* data, uint16_t index, uint16_t amount){
  /*  
    Read "index" amount of logs, starting from the given index.
      If amount is 0, it will return the number of logs saved.
  */

  File file = SPIFFS.open(LOGS_FILE_NAME, "r");   //Open file
  if(file){
    uint16_t size = file.size();

    if(amount == 0 || index >= size) return size;

    if(index+amount >= (size/sizeof(Logs))){   //If size exceeded, amount to read is modified.
      amount = size - index;
    }
    
    if(index + (amount * sizeof(Logs)) >= size){  //Avoid reading illegal values.
      return 0;
    }

    file.seek(index, fs::SeekSet);    //Move the cursor "index" bytes from the beginning.
    uint16 currpos = file.position();
    Serial.printf("\ncurrpos = %d\n", currpos);
    for (uint16 i = 0; i < (amount * sizeof(Logs)); i++)  //Read "bytes" number of bytes from the index position. 
    {
      ((uint8_t*)data)[i] = file.read(); 
    } 
    file.close();    //Close file.
    return amount;
  }
  else{
    Serial.printf("Failed to open [%s] file for reading", LOGS_FILE_NAME);
    return 0;
  }
}
 


//////////////////////////// WEB SERVER FUNCTIONS /////////////////////////////////
unsigned char runWebServer(void){ 

  String ap_ssid="Datalogger";
  String ap_pssw="123456789!";
  
  IPAddress local_IP(192,168,0,170);  //192.168.0.170
  IPAddress gateway(192,168,0,1);   //192.168.0.1
  IPAddress subnet(255,255,255,0);  //255.255.255.255
  WiFi.softAPConfig(local_IP, gateway, subnet);
  WiFi.mode(WIFI_AP);
  while(!WiFi.softAP(ap_ssid, ap_pssw))
  {
    Serial.println(".");
    delay(100);
  }
 
 
  // wifiTurnOn();
  // WiFi.config(local_IP, gateway, subnet);
  // WiFi.begin(config_globals.network_ap_ssid, config_globals.network_ap_pass);
  // while(WiFi.status() != WL_CONNECTED){ //Blocks until Wifi is connected. 
  //   digitalWrite(LED_B_PIN, LOW); //Blink GREEN led.
  //   delay(50);
  //   digitalWrite(LED_B_PIN, HIGH);  
  //   yield(); 
  // }

  LED_Color(COLOR_YELLOW); //Turns on red LED.
  //analogWriteFreq(5);   //See minimum frequency

