BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
  // start server
  server.begin();
  Serial.println("HTTP server started");

  Serial.println("");
  Serial.print("Initialized AP:\t");
  Serial.println(ap_ssid);
  Serial.print("IP address:\t");
  Serial.println(WiFi.softAPIP());
  Serial.print("MAC address:\t");
  Serial.println(WiFi.macAddress());
 
  
  server.on("/",handleHome);
  server.on("/change_network_config", handleChangeNetworkConfig);
  server.on("/change_server_config", handleChangeServerConfig);
  server.on("/format_ram",handleFormatRam);
  server.on("/format_flash",handleFormatFlash);
  server.on("/reset_archive_sent_pointer",handleResetSentPointer);
  server.on("/device_turn_off",handleTurnOffDevice);
  server.on("/get_parameters",handleGetParameters);
  server.on("/device_config",handleChangeConfig);


  

  return(1);
}

void handleHome(void){
  Serial.print("\n/");
  //Returns main page.
  server.send(200, "text/html", index_html);
  Serial.printf("\n\n    Number of clients connected: %d", wifi_softap_get_station_num());
  // log_event(Logs::CONFIG_MODE);

  // char buf[100*sizeof(Logs)];
  // Logs l;
  // int q = read_log(buf, 0, 0);
  // Serial.printf("\nLogs:");
  // for (int i = 0; i < q; i++)
  // {
  //   memcpy(&l, &buf[i*sizeof(Logs)], sizeof(Logs));
  //   Serial.printf("\ntimestamp: %d / battery_level:%d / event:%d",l.timestamp, l.battery_level, l.event_type);
  // }

}

void handleChangeNetworkConfig(void){
    Serial.print("/change_network_config");
    String new_ssid, new_password;
    
    if (server.hasArg("new_ssid") && server.hasArg("new_password"))
    {
        // new_ssid = server.arg("new_ssid");
        // new_password = server.arg("new_password");
        server.arg(0).toCharArray(config_globals.network_ap_ssid, sizeof(config_globals.network_ap_ssid));
        server.arg(1).toCharArray(config_globals.network_ap_pass, sizeof(config_globals.network_ap_pass));
        //Change parameters in Flash config file.
        saveGlobals();

        // server.send(200, "text/plain", "Network credentials modified correctly.");
        server.send(200);   //Return code 200 (OK).

        // Serial.printf("\nNetwork credentials modified:\nSSID:%s\nPass:%s",new_ssid,new_password);
    }
    else
    {
        server.send(200, "text/html", "ERROR: Wrong parameters.");
    }
}

void handleChangeServerConfig(void){
  Serial.print("/change_server_config");
  String new_ip, new_port;
  
  if (server.hasArg("ip") && server.hasArg("port"))
  {
      new_ip = server.arg("new_ip");
      new_port = server.arg("new_port");
      /* Validate ip and port number */
      server.arg(0).toCharArray(config_globals.server_ip, sizeof(config_globals.server_ip));
      config_globals.server_port=server.arg(1).toInt();

      saveGlobals();

      //Change parameters in Flash config file.
      // server.send(200, "text/plain", "Server parameters modified correctly.");
      server.send(200);   //Return code 200 (OK).
      // Serial.printf("\nServer parameters modified:\nIP:%s\nPort:%s",new_ip,new_port);
  }
  else
  {
      server.send(200, "text/html", "ERROR: Wrong parameters.");
      server.send
  } 
}

unsigned char handleFormatRam(void){
  if (server.hasArg("command"))
  {
    if(server.arg("command") == "format_confirm"){
      /*Call to format RAM*/
      rtcmem.clear();                   //Reset values to dafault.
      rtcmem.safeDisconnect();          //Saves current values in NVM.
      Serial.printf("RAM Formatted.");
      // server.send(200, "text/plain", "Server parameters modified correctly.");
      server.send(200);   //Return code 200 (OK).

      return(1);  //Returns 1 to inform that RAM has been erased correctly. This should drive to a reboot.
    }
  }
  server.send(200, "text/html", "ERROR: Wrong parameters.");
  return(0);  //Returns 1 to inform that RAM has NOT been erased correctly.
}

unsigned char handleFormatFlash(void){
  
  if(SPIFFS.remove(MEASUREMENTS_FILE_NAME)){    //Delete file.
    //SPIFFS.format();
    SPIFFS.remove(NVM_POINTERS_FILE_NAME);    //Delete variables backup.
    SPIFFS.remove(LOGS_FILE_NAME);    //Delete logs file.
    // SPIFFS.remove(CONFIG_FILE_NAME);          //Delete 
    Serial.printf("\nFLASH Formatted.\n");

    rtcmem.clear();             //Write default values into rtc memory.
    rtcmem.safeDisconnect();    //Saves default values into NVM.

    server.send(200);   //Return code 200 (OK).

    return(1);  //Returns 1 to inform that FLASH has been erased correctly. This should drive to a reboot.
  }
  else return 0;

}

unsigned char handleResetSentPointer(void){
  Serial.print("\nresetting archive_sent_pointer...");
  rtcmem.var.archive_sent_pointer = 0;
  rtcmem.rwVariables();   //Save variables to RTC memory.
  server.send(200);   //Return code 200 (OK).
  Serial.printf("\n\n    archive_sent_pointer reset. New value: %d", rtcmem.var.archive_sent_pointer);
  Serial.printf("\n\n    archive_saved_pointer current value: %d", rtcmem.var.archive_saved_pointer);
}

unsigned char handleTurnOffDevice(void){
  Serial.print("\n\n Device set to turn off...");
  statem.setState(STATE_SEALED);
}

bool handleChangeConfig(void){
  /*
    Open configuration file and overwrite the values received. 
    If any entry is invalid or blank/null, don\\\"t overwrite it.
    Also data should be validated from both browser (Javascript code) 
    and this function too, in order to avoid errors.
  */
  //Number of args.
  Serial.print("\n\n (/device_config) - args:\n");
  for (uint16_t i = 0; i < server.args(); i++)
  {
      Serial.printf("\n arg %d->", i);
      Serial.println(String(server.argName(i)));
      Serial.println(String(server.arg(i)));
  }

  // server.arg(0).toCharArray(config_globals.network_ap_ssid, sizeof(config_globals.network_ap_ssid));
  // server.arg(1).toCharArray(config_globals.network_ap_pass, sizeof(config_globals.network_ap_pass));
  // server.arg(2).toCharArray(config_globals.server_ip, sizeof(config_globals.server_ip));
  // server.arg("local_ip").toCharArray(config_globals.local_ip, sizeof(config_globals.local_ip));
  // server.arg("wifi_security_type").toCharArray(config_globals.wifi_security_type, sizeof(config_globals.wifi_security_type));

  // config_globals.server_port=server.arg(3).toInt();
  config_globals.network_connection_timeout=server.arg(4).toInt();
  config_globals.server_connection_retry=server.arg(5).toInt();
  // config_globals.server_connection_timeout=server.arg("server_connection_timeout").toInt();
  // config_globals.response_timeout=server.arg("response_timeout").toInt();
  config_globals.id_transceiver=server.arg(6).toInt();
  config_globals.id_sensor_a=server.arg(7).toInt();
  config_globals.id_sensor_b=server.arg(8).toInt();
  config_globals.id_sensor_c=server.arg(9).toInt();
  config_globals.id_sensor_d=server.arg(10).toInt();
  config_globals.sample_time=server.arg(11).toInt();
  // config_globals.connection_time[0]=server.arg("").toInt();  //6:30 a.m. UTC
  // config_globals.connection_time[0]=server.arg("").toInt();

  Serial.print("\n Configuration parameters modified:\n");
  Serial.print("\n network_ap_ssid:");
  Serial.println(config_globals.network_ap_ssid);
  Serial.print("\n network_ap_pass:");
  Serial.println(config_globals.network_ap_pass);
  Serial.print("\n server_ip:");
  Serial.println(config_globals.server_ip);

