BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
  Serial.printf("\n server_port: %d",config_globals.server_port);
  Serial.printf("\n server_connection_retry: %d", config_globals.server_connection_retry);
  Serial.printf("\n network_connection_timeout: %d", config_globals.network_connection_timeout);
  Serial.printf("\n id_transceiver: %d", config_globals.id_transceiver);
  Serial.printf("\n id_sensor_a: %d", config_globals.id_sensor_a);
  Serial.printf("\n id_sensor_b: %d", config_globals.id_sensor_b);
  Serial.printf("\n id_sensor_c: %d", config_globals.id_sensor_c);
  Serial.printf("\n id_sensor_d: %d", config_globals.id_sensor_d);
  Serial.printf("\n sample_time: %d", config_globals.sample_time);

  /* void* p = &config_globals;
  File file = SPIFFS.open(CONFIG_FILE_NAME, "w");
  if (file) {       //If file opened correctly...

      Serial.printf("\nglobals saved:");
      for (uint16 i = 0; i < sizeof(config_globals); i++)
      {
        Serial.printf("%X ", ((const char*)p)[i]);
      }

      file.write((const char*)(p), sizeof(Variables)); //Overwrites previous data.
      file.close();
      return true;
  }

  return false; */
  saveGlobals();
  server.send(200);   //Returns that everything is updated OK.
  return true;
}

unsigned char handleGetParameters(void){
  //Send configuration parameters to the client.
  String parameters = "\"{";
  parameters += "\\\"network_ap_ssid\\\":\\\""+String(config_globals.network_ap_ssid)+"\\\"";
  parameters += ",\\\"network_ap_pass\\\":\\\""+String(config_globals.network_ap_pass)+"\\\"";
  parameters += ",\\\"server_ip\\\":\\\""+String(config_globals.server_ip)+"\\\"";
  parameters += ",\\\"server_port\\\":"+String(config_globals.server_port);
  parameters += ",\\\"network_connection_timeout\\\":"+String(config_globals.network_connection_timeout);
  parameters += ",\\\"server_connection_retry\\\":"+String(config_globals.server_connection_retry);
  parameters += ",\\\"id_transceiver\\\":"+String(config_globals.id_transceiver);
  parameters += ",\\\"id_sensor_a\\\":"+String(config_globals.id_sensor_a);
  parameters += ",\\\"id_sensor_b\\\":"+String(config_globals.id_sensor_b);
  parameters += ",\\\"id_sensor_c\\\":"+String(config_globals.id_sensor_c);
  parameters += ",\\\"id_sensor_d\\\":"+String(config_globals.id_sensor_d);
  parameters += ",\\\"sample_time\\\":"+String(config_globals.sample_time);

  parameters += "}\"";
  Serial.print("\n\nparameters sent to web interface:\n");
  Serial.println(parameters);
  server.send(200, "text/plain", parameters);

}

bool saveGlobals(void){
  /*
    SEE HOW TO SAVE TO EEPROM... (?)
  */
  Config_globals* g = &config_globals;

  File file = SPIFFS.open(CONFIG_FILE_NAME, "w");   //Open file
  if (file){
    int bytesWritten = file.write((const char*)(g), sizeof(Config_globals)); //Overwrites previous data.
    file.close();
    return true;
  }
  return false;
}

Config_globals readGlobals(void){
  Config_globals g;

  uint8_t buf[sizeof(Config_globals)]; //temporary buffer.

  File file = SPIFFS.open(CONFIG_FILE_NAME, "r");   //Open file
  if (file){        //If file opens correctly...
    // Serial.print("\n  Config_globals: ");  
    for (uint16_t i = 0; i < sizeof(buf); i++)
    {
      buf[i] = file.read(); //Copies the read byte 
      // Serial.printf("%X ",  buf[i]);
    } 
    file.close();
    memcpy(&g, buf, sizeof(buf));  //Copies read data to the variable.
    // rwVariables();  //Stores read data to RTC memory.    ////////////////// REMOVED FOR TESTING ///////////
    return g;
  }
  else{     //Load default values.
    strcpy(config_globals.network_ap_ssid,"DATALOGGER SERVER");
    strcpy(config_globals.network_ap_pass,"!UBA12345!");
    strcpy(config_globals.server_ip, "192.168.123.123");
    strcpy(config_globals.local_ip,"192.168.123.2");
    strcpy(config_globals.wifi_security_type,"WPA2");

    config_globals.server_port=8080;
    config_globals.server_connection_retry=2;
    config_globals.network_connection_timeout=10000;
    config_globals.server_connection_timeout=2000;
    config_globals.response_timeout=5000;
    config_globals.id_transceiver=0;
    config_globals.id_sensor_a=1;
    config_globals.id_sensor_b=2;
    config_globals.id_sensor_c=3;
    config_globals.id_sensor_d=4;
    config_globals.sample_time=3600;
    config_globals.connection_time[0]=3;  //6:30 a.m. UTC
    config_globals.connection_time[1]=30;

    saveGlobals();
  }
}

/*
    Make funcions to:
        Get last measurements and save them to RTC RAM (non-volatile on boot).
        Get gathered data packets (temperature and humidity) from RTC RAM and save them to FLASH (SPIFFS).
        Update/increment measurements counter in RTC RAM (not to count each measurement taken from the file).
    -----------------------------------------
        Initialize RTC memory and FLASH memory.
        Program must boot and call this function. If device 



    -----------------------------------------
        Get pending data packets from FLASH memory. Pending packets are determined by the difference between 
      the measurements_counter and the last_sent_measurement index.
        Transform them into human-legible format (i.e. -135 -> -
      º  13,5ºC  or 45 -> 45% RH and so).
        Generate POST request with every value to be sent:
          id_transceiver, battery_level, id_sensor[], timestamp[], temperature[], humidity[].
          In case the quantity of packets to be transmitted would exceed the maximum supported (see 
          datalogger_config.h), only a bunch of them is loaded, and the following will be sent in a separate 
          request following this one.
          After each packet is correctly sent, the last_sent_measurement index is updated so in the next
          request the device will send only the not sent ones.
    -----------------------------------------  
      Get date and time from server. When connected to it, once packets are sent, a request for 
        date and time is generated
    -----------------------------------------
        Manage times: 
          From the time the device goes deep-sleep mode (sent to the funcion goDeepSleep) to the time it actually
          boots and takes measurements, connect and send the packets, there is a lapse which must be tracked or 
          taken into account. Function millis() can be used to that.
*/
